music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "DF9qgiWJsHjkG6V8hpdIEg"], ["id", 2]]
---
    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)